[Survived] BlockStatement
src/Roller.ts:29:47
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number{
-        if (value < 1 || value > this._faces) {
-          return 0;
-        }
+        if (value < 1 || value > this._faces) {}
         this._last = value;
         let count = this._distribution.get(value) ?? 0;

[Survived] LogicalOperator
src/Roller.ts:29:13
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
     roll(value: number): number{
-        if (value < 1 || value > this._faces) {
+        if (value < 1 && value > this._faces) {
           return 0;
         }
