[Killed] BlockStatement
src/Roller.ts:9:32
     // specifies the number of faces the die has. It must have at least 2 faces
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
-    constructor(faces: number) {
-        if (faces < 2) {
-          faces = 6;
-        }
-        this._distribution = new Map<number, number>();
-        this._last = -1;
-        this._faces = faces;
-      }
+    constructor(faces: number) {}
 
     // specifies which number should be rolled and returns the recorded roll. 
killedBy: Roller tests roll function when roll made is 1 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Survived] EqualityOperator
src/Roller.ts:10:13
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if (faces < 2) {
+        if (faces >= 2) {
           faces = 6;
         }

[Survived] ConditionalExpression
src/Roller.ts:10:13
     // so any invalid values should default to 6 to represent the common 
     // six-sided die.
     constructor(faces: number) {
-        if (faces < 2) {
+        if (true) {
           faces = 6;
         }

[Survived] UnaryOperator
src/Roller.ts:14:22
           faces = 6;
         }
         this._distribution = new Map<number, number>();
-        this._last = -1;
+        this._last = +1;
         this._faces = faces;
       }

[Killed] BlockStatement
src/Roller.ts:28:32
     //   3. the distribution should update the distribution record so that the
     //      key (value rolled) has an updated value that increases the number
     //      of rolls for that face by 1
-    roll(value: number): number{
-        if (value < 1 || value > this._faces) {
-          return 0;
-        }
-        this._last = value;
-        let count = this._distribution.get(value) ?? 0;
-        this._distribution.set(value, count + 1);
-        return value;
-      }
+    roll(value: number): number{}
 
     // returns the value of the latest die roll. If no rolls have been made
killedBy: Roller tests roll function when roll made is 0 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] LogicalOperator
src/Roller.ts:33:21
           return 0;
         }
         this._last = value;
-        let count = this._distribution.get(value) ?? 0;
+        let count = this._distribution.get(value) && 0;
         this._distribution.set(value, count + 1);
         return value;
killedBy: Roller tests distribution function when some rolls made
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: NaN

[Killed] ArithmeticOperator
src/Roller.ts:34:39
         }
         this._last = value;
         let count = this._distribution.get(value) ?? 0;
-        this._distribution.set(value, count + 1);
+        this._distribution.set(value, count - 1);
         return value;
       }
killedBy: Roller tests distribution function when some rolls made
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: -1

[NoCoverage] BlockStatement
src/Roller.ts:40:20
 
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
-    last(): number {
-        return this._last??0;
-    }
+    last(): number {}
 
     // returns a Map that represents the current distribution of rolls for each

[NoCoverage] LogicalOperator
src/Roller.ts:41:16
     // returns the value of the latest die roll. If no rolls have been made
     // yet, then it should return 0.
     last(): number {
-        return this._last??0;
+        return this._last && 0;
     }
 

[Killed] BlockStatement
src/Roller.ts:49:40
     // value and its value should be the number of times that face has been
     // rolled. Even if a face has not yet been rolled, its key should have a
     // value of 0.
-    distribution(): Map<number, number>{
-        const dist = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
-          dist.set(i, this._distribution.get(i) ?? 0);
-        }
-        return dist;
-      }
+    distribution(): Map<number, number>{}
 } // end of Roller class
 
killedBy: Roller tests roll function when roll made is 1 
statusReason: TypeError: Cannot read properties of undefined (reading 'get')

[Killed] ConditionalExpression
src/Roller.ts:51:25
     // value of 0.
     distribution(): Map<number, number>{
         const dist = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
+        for (let i = 1; false; i++) {
           dist.set(i, this._distribution.get(i) ?? 0);
         }
killedBy: Roller tests roll function when roll made is 1 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] EqualityOperator
src/Roller.ts:51:25
     // value of 0.
     distribution(): Map<number, number>{
         const dist = new Map<number, number>();
-        for (let i = 1; i <= this._faces; i++) {
+        for (let i = 1; i > this._faces; i++) {
           dist.set(i, this._distribution.get(i) ?? 0);
         }
killedBy: Roller tests roll function when roll made is 1 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] LogicalOperator
src/Roller.ts:52:23
     distribution(): Map<number, number>{
         const dist = new Map<number, number>();
         for (let i = 1; i <= this._faces; i++) {
-          dist.set(i, this._distribution.get(i) ?? 0);
+          dist.set(i, this._distribution.get(i) && 0);
         }
         return dist;
killedBy: Roller tests roll function when roll made is 1 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined
